espressif/esp-idf/components/soc/esp32s2/include/soc/spi_struct.h
            uint32_t rx_eof_en:               1;          /*1: spi_dma_inlink_eof is set when the number of dma pushed data bytes is equal to the value of spi_slv/mst_dma_rd_bytelen[19:0] in spi dma transition.  0: spi_dma_inlink_eof is set by spi_trans_done in non-seg-trans or spi_dma_seg_trans_done in seg-trans.*/
            uint32_t infifo_full_clr:         1;          /*1:Clear spi_dma_infifo_full_vld. 0: Do not control it.*/
            uint32_t outfifo_empty_clr:       1;          /*1:Clear spi_dma_outfifo_empty_vld. 0: Do not control it.*/
            uint32_t infifo_full_err:         1;          /*1:spi_dma_infifo_full and spi_push_data_prep are valid  which means that DMA Rx buffer is full but push is valid.  0: Others.  Can not be changed by CONF_buf.*/
            uint32_t outfifo_empty_err:       1;          /*1:spi_dma_outfifo_empty and spi_pop_data_prep are valid  which means that there is no data to pop but pop is valid.  0: Others.  Can not be changed by CONF_buf.*/
            uint32_t ext_mem_bk_size:         2;          /*Select the external memory block size.*/
            uint32_t reserved28:              4;          /*reserved*/
        };
        uint32_t val;
    } dma_conf;
    union {
        struct {
            uint32_t addr:           20;                  /*The address of the first outlink descriptor.*/
            uint32_t reserved20:      8;                  /*reserved*/
            uint32_t stop:            1;                  /*Set the bit to stop to use outlink descriptor.*/
            uint32_t start:           1;                  /*Set the bit to start to use outlink descriptor.*/
            uint32_t restart:         1;                  /*Set the bit to mount on new outlink descriptors.*/
            uint32_t dma_tx_ena:      1;                  /*spi dma write data status bit.*/
        };
        uint32_t val;
    } dma_out_link;
    union {
        struct {
            uint32_t addr:           20;                  /*The address of the first inlink descriptor.*/
            uint32_t auto_ret:        1;                  /*when the bit is set  the inlink descriptor returns to the first link node when a packet is error.*/
            uint32_t reserved21:      7;                  /*reserved*/
            uint32_t stop:            1;                  /*Set the bit to stop to use inlink descriptor.*/
            uint32_t start:           1;                  /*Set the bit to start to use inlink descriptor.*/
            uint32_t restart:         1;                  /*Set the bit to mount on new inlink descriptors.*/
            uint32_t dma_rx_ena:      1;                  /*spi dma read data status bit.*/
        };
        uint32_t val;
    } dma_in_link;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;       /*The enable bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;       /*The enable bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;       /*The enable bit for inlink descriptor error.*/
            uint32_t in_done:                    1;       /*The enable bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;       /*The enable bit for receiving error.*/
            uint32_t in_suc_eof:                 1;       /*The enable bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;       /*The enable bit for completing usage of a outlink descriptor .*/
            uint32_t out_eof:                    1;       /*The enable bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;       /*The enable bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;       /*reserved*/
        };
        uint32_t val;
    } dma_int_ena;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;       /*The raw bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;       /*The raw bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;       /*The raw bit for inlink descriptor error.*/
            uint32_t in_done:                    1;       /*The raw bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;       /*The raw bit for receiving error.*/
            uint32_t in_suc_eof:                 1;       /*The raw bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;       /*The raw bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;       /*The raw bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;       /*The raw bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;       /*reserved*/
        };
        uint32_t val;
    } dma_int_raw;
    union {
        struct {
            uint32_t inlink_dscr_empty:         1;        /*The status bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:        1;        /*The status bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:         1;        /*The status bit for inlink descriptor error.*/
            uint32_t in_done:                   1;        /*The status bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                1;        /*The status bit for receiving error.*/
            uint32_t in_suc_eof:                1;        /*The status bit for completing receiving all the packets from host.*/
            uint32_t out_done:                  1;        /*The status bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                   1;        /*The status bit for sending a packet to host done.*/
            uint32_t out_total_eof:             1;        /*The status bit for sending all the packets to host done.*/
            uint32_t reserved9:                23;        /*reserved*/
        };
        uint32_t val;
    } dma_int_st;
    union {
        struct {
            uint32_t inlink_dscr_empty:          1;       /*The clear bit for lack of enough inlink descriptors.*/
            uint32_t outlink_dscr_error:         1;       /*The clear bit for outlink descriptor error.*/
            uint32_t inlink_dscr_error:          1;       /*The clear bit for inlink descriptor error.*/
            uint32_t in_done:                    1;       /*The clear bit for completing usage of a inlink descriptor.*/
            uint32_t in_err_eof:                 1;       /*The clear bit for receiving error.*/
            uint32_t in_suc_eof:                 1;       /*The clear bit for completing receiving all the packets from host.*/
            uint32_t out_done:                   1;       /*The clear bit for completing usage of a outlink descriptor.*/
            uint32_t out_eof:                    1;       /*The clear bit for sending a packet to host done.*/
            uint32_t out_total_eof:              1;       /*The clear bit for sending all the packets to host done.*/
            uint32_t reserved9:                 23;       /*reserved*/
        };
        uint32_t val;
    } dma_int_clr;
    uint32_t dma_in_err_eof_des_addr;                         /*The inlink descriptor address when spi dma produce receiving error.*/
    uint32_t dma_in_suc_eof_des_addr;                         /*The last inlink descriptor address when spi dma produce from_suc_eof.*/
    uint32_t dma_inlink_dscr;                                 /*The content of current in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf0;                             /*The content of next in descriptor pointer.*/
    uint32_t dma_inlink_dscr_bf1;                             /*The content of current in descriptor data buffer pointer.*/
    uint32_t dma_out_eof_bfr_des_addr;                        /*The address of buffer relative to the outlink descriptor that produce eof.*/
    uint32_t dma_out_eof_des_addr;                            /*The last outlink descriptor address when spi dma produce to_eof.*/
    uint32_t dma_outlink_dscr;                                /*The content of current out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf0;                            /*The content of next out descriptor pointer.*/
    uint32_t dma_outlink_dscr_bf1;                            /*The content of current out descriptor data buffer pointer.*/
    union {
        struct {
            uint32_t out_dscr_addr:    18;                /*SPI dma out descriptor address.*/
            uint32_t out_dscr_state:    2;                /*SPI dma out descriptor state.*/
            uint32_t out_state:         3;                /*SPI dma out data state.*/
            uint32_t out_fifo_cnt:      7;                /*The remains of SPI dma outfifo data.*/
            uint32_t out_fifo_full:     1;                /*SPI dma outfifo is full.*/
            uint32_t out_fifo_empty:    1;                /*SPI dma outfifo is empty.*/
        };
        uint32_t val;
    } dma_out_status;
    union {
        struct {
            uint32_t in_dscr_addr:    18;                 /*SPI dma in descriptor address.*/
            uint32_t in_dscr_state:    2;                 /*SPI dma in descriptor state.*/
            uint32_t in_state:         3;                 /*SPI dma in data state.*/
            uint32_t in_fifo_cnt:      7;                 /*The remains of SPI dma infifo data.*/
            uint32_t in_fifo_full:     1;                 /*SPI dma infifo is full.*/
            uint32_t in_fifo_empty:    1;                 /*SPI dma infifo is empty.*/
        };
        uint32_t val;
    } dma_in_status;
    uint32_t data_buf[18];                                          /*data buffer*/
    union {
        struct {
            uint32_t din0_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din1_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din2_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din3_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din4_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din5_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din6_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t din7_mode:      3;                   /*the input signals are delayed by system clock cycles  0: input without delayed  1: input with the posedge of clk_apb 2 input with the negedge of clk_apb  3: input with the spi_clk*/
            uint32_t timing_clk_ena: 1;                   /*1:enable hclk in spi_timing.v.  0: disable it.*/
            uint32_t reserved25:     7;                   /*reserved*/
        };
        uint32_t val;
    } din_mode;
    union {
        struct {
            uint32_t din0_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din1_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din2_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din3_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din4_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din5_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din6_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t din7_num:   2;                       /*the input signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved16:16;                       /*reserved*/
        };
        uint32_t val;
    } din_num;
    union {
        struct {
            uint32_t dout0_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout1_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout2_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout3_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout4_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout5_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout6_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t dout7_mode: 3;                       /*the output signals are delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t reserved24: 8;                       /*reserved*/
        };
        uint32_t val;
    } dout_mode;
    union {
        struct {
            uint32_t dout0_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout1_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout2_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout3_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout4_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout5_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout6_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t dout7_num:  2;                       /*the output signals are delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved16:16;                       /*reserved*/
        };
        uint32_t val;
    } dout_num;
    union {
        struct {
            uint32_t lcd_hb_front:    11;                 /*It is the horizontal blank front porch of a frame.*/
            uint32_t lcd_va_height:   10;                 /*It is the vertical active height of a frame.*/
            uint32_t lcd_vt_height:   10;                 /*It is the vertical total height of a frame.*/
            uint32_t lcd_srgb_mode_en: 1;                 /*1: Enable LCD mode output vsync  hsync  de. 0: Disable.*/
        };
        uint32_t val;
    } lcd_ctrl;
    union {
        struct {
            uint32_t lcd_vb_front: 8;                     /*It is the vertical blank front porch of a frame.*/
            uint32_t lcd_ha_width:12;                     /*It is the horizontal active width of a frame.*/
            uint32_t lcd_ht_width:12;                     /*It is the horizontal total width of a frame.*/
        };
        uint32_t val;
    } lcd_ctrl1;
    union {
        struct {
            uint32_t lcd_vsync_width:    7;               /*It is the position of spi_vsync_out active pulse in a line.*/
            uint32_t vsync_idle_pol:     1;               /*It is the idle value of spi_vsync_out.*/
            uint32_t lcd_vsync_position: 8;               /*It is the position of spi_vsync_out active pulse in a line.*/
            uint32_t lcd_hsync_width:    7;               /*It is the position of spi_hsync_out active pulse in a line.*/
            uint32_t hsync_idle_pol:     1;               /*It is the idle value of spi_hsync_out.*/
            uint32_t lcd_hsync_position: 8;               /*It is the position of spi_hsync_out active pulse in a line.*/
        };
        uint32_t val;
    } lcd_ctrl2;
    union {
        struct {
            uint32_t d_dqs_mode:   3;                     /*the output spi_dqs is delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t d_cd_mode:    3;                     /*the output spi_cd is delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t d_de_mode:    3;                     /*the output spi_de is delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t d_hsync_mode: 3;                     /*the output spi_hsync is delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t d_vsync_mode: 3;                     /*the output spi_vsync is delayed by system clock cycles  0: output without delayed  1: output with the posedge of clk_apb 2 output with the negedge of clk_apb  3: output with the spi_clk*/
            uint32_t reserved15:  17;                     /*reserved*/
        };
        uint32_t val;
    } lcd_d_mode;
    union {
        struct {
            uint32_t d_dqs_num:   2;                      /*the output spi_dqs is delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t d_cd_num:    2;                      /*the output spi_cd is delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t d_de_num:    2;                      /*the output spi_de is delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t d_hsync_num: 2;                      /*the output spi_hsync is delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t d_vsync_num: 2;                      /*the output spi_vsync is delayed by system clock cycles  0: delayed by 1 cycle  1: delayed by 2 cycles ...*/
            uint32_t reserved10: 22;                      /*reserved*/
        };
        uint32_t val;
    } lcd_d_num;
    uint32_t reserved_110;
    uint32_t reserved_114;
    uint32_t reserved_118;
    uint32_t reserved_11c;
    uint32_t reserved_120;
    uint32_t reserved_124;
    uint32_t reserved_128;
    uint32_t reserved_12c;
    uint32_t reserved_130;
    uint32_t reserved_134;
    uint32_t reserved_138;
    uint32_t reserved_13c;
    uint32_t reserved_140;
    uint32_t reserved_144;
    uint32_t reserved_148;
    uint32_t reserved_14c;
    uint32_t reserved_150;
    uint32_t reserved_154;
    uint32_t reserved_158;
    uint32_t reserved_15c;
    uint32_t reserved_160;
    uint32_t reserved_164;
    uint32_t reserved_168;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    uint32_t reserved_190;
    uint32_t reserved_194;
    uint32_t reserved_198;
    uint32_t reserved_19c;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t reserved_1f8;
    uint32_t reserved_1fc;
    uint32_t reserved_200;
    uint32_t reserved_204;
    uint32_t reserved_208;
    uint32_t reserved_20c;
    uint32_t reserved_210;
    uint32_t reserved_214;
    uint32_t reserved_218;
    uint32_t reserved_21c;
    uint32_t reserved_220;
    uint32_t reserved_224;
    uint32_t reserved_228;
    uint32_t reserved_22c;
    uint32_t reserved_230;
    uint32_t reserved_234;
    uint32_t reserved_238;
    uint32_t reserved_23c;
    uint32_t reserved_240;
    uint32_t reserved_244;
    uint32_t reserved_248;
    uint32_t reserved_24c;
    uint32_t reserved_250;
    uint32_t reserved_254;
    uint32_t reserved_258;
    uint32_t reserved_25c;
    uint32_t reserved_260;
    uint32_t reserved_264;
    uint32_t reserved_268;
    uint32_t reserved_26c;
    uint32_t reserved_270;
    uint32_t reserved_274;
    uint32_t reserved_278;
    uint32_t reserved_27c;
    uint32_t reserved_280;
    uint32_t reserved_284;
    uint32_t reserved_288;
    uint32_t reserved_28c;
    uint32_t reserved_290;
    uint32_t reserved_294;
